#include <gpioconfig.h>

/**************************************************************************
注：
P0M0 = 0x00; //设置 P0.0~P0.7 为双向口模式
P0M1 = 0x00;
P1M0 = 0xff; //设置 P1.0~P1.7 为推挽输出模式
P1M1 = 0x00;
P2M0 = 0x00; //设置 P2.0~P2.7 为高阻输入模式
P2M1 = 0xff;
P3M0 = 0xff; //设置 P3.0~P3.7 为开漏模式
P3M1 = 0xff;
**************************************************************************/
void gpioconfig()
{
	P0M0 = 0x00; 
	P0M1 = 0x08;	  //P0.3为输入ADC，高阻输入模式(作为入网随机时间，执行1次） 		
	P1M0 = 0x08; 
	P1M1 = 0x04;	 	//P1.2为输入ADC，高阻输入模式
	P2M0 = 0x00; 
	P2M1 = 0x00;
	P3M0 = 0x00; 
	P3M1 = 0x00;
	P4M0 = 0x00; 
	P4M1 = 0x00;
	P5M0 = 0x28;		//P5.5继电器控制引脚，设置为推挽输出
	P5M1 = 0x00;
	P6M0 = 0x00; 
	P6M1 = 0x00;
	P7M0 = 0x00; 
	P7M1 = 0x00;
	P_SW1= 0x04;
	P_SW2= 0x80;		
	wp=0;
}
